tests/performance/stress-test.yml
config:
  target: "https://tradeai.gonxt.tech"
  phases:
    # Stage 1: 50 users for 2 minutes
    - duration: 120
      arrivalRate: 50
      name: "Stage 1 - 50 users"
    
    # Stage 2: 100 users for 2 minutes
    - duration: 120
      arrivalRate: 100
      name: "Stage 2 - 100 users"
    
    # Stage 3: 200 users for 2 minutes
    - duration: 120
      arrivalRate: 200
      name: "Stage 3 - 200 users"
    
    # Stage 4: 400 users for 2 minutes
    - duration: 120
      arrivalRate: 400
      name: "Stage 4 - 400 users"
    
    # Stage 5: 600 users for 2 minutes
    - duration: 120
      arrivalRate: 600
      name: "Stage 5 - 600 users"
    
    # Stage 6: 800 users for 2 minutes
    - duration: 120
      arrivalRate: 800
      name: "Stage 6 - 800 users"
    
    # Stage 7: 1000 users for 2 minutes (breaking point test)
    - duration: 120
      arrivalRate: 1000
      name: "Stage 7 - 1000 users (stress)"
    
    # Stage 8: 1500 users for 2 minutes (extreme stress)
    - duration: 120
      arrivalRate: 1500
      name: "Stage 8 - 1500 users (extreme stress)"
    
    # Recovery: drop to 50 users
    - duration: 60
      arrivalRate: 50
      name: "Recovery - 50 users"
  
  plugins:
    expect: {}
  
  # Relaxed thresholds for stress testing (we expect some failures)
  ensure:
    maxErrorRate: 10                   # Allow up to 10% errors during stress
  
  # Extended timeout for stressed system
  timeout: 60
  
  # Large connection pool
  http:
    pool: 1000
  
  # Variables
  variables:
    testEmail: "admin@trade-ai.com"
    testPassword: "Admin@123"

scenarios:
  - name: "Health Check Only"
    weight: 40
    flow:
      - get:
          url: "/api/health"

  - name: "ML Health Check"
    weight: 30
    flow:
      - get:
          url: "/ml/health"

  - name: "Auth + Single Request"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/ai/forecast/demand"
          headers:
            Authorization: "Bearer {{ authToken }}"
          qs:
            startDate: "2025-01-01"
            endDate: "2025-12-31"

  - name: "Homepage Load"
    weight: 10
    flow:
      - get:
          url: "/"